# Ex3 - Getting and Knowing your Data

In [1]:
import numpy as np,pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [19]:
users=pd.read_csv(r"C:\Users\pc\Downloads\u.user.csv",delimiter='|',index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [10]:
users.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

### Step 5. See the last 10 entries

In [12]:
users.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [22]:
len(users)

943

In [97]:
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [21]:
len(users.columns)

4

In [98]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [20]:
print(users.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [32]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [25]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [34]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [56]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations there are in this dataset?

In [39]:
users['occupation'].value_counts().count()

21

In [46]:
users['occupation'].nunique()

21

### Step 13. What is the most frequent occupation?

In [87]:
a = users['occupation'].value_counts().sort_values(ascending=False)

In [88]:
a

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

### Step 14. Summarize the DataFrame.

In [48]:
users.describe().T

     count       mean       std  min   25%   50%   75%   max
age  943.0  34.051962  12.19274  7.0  25.0  31.0  43.0  73.0

### Step 15. Summarize all the columns

In [49]:
users.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
age,943.0,NaN,NaN,NaN,34.051962,12.19274,7.0,25.0,31.0,43.0,73.0
gender,943,2,M,670,NaN,NaN,NaN,NaN,NaN,NaN,NaN
occupation,943,21,student,196,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zip_code,943,795,55414,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Step 16. Summarize only the occupation column

In [57]:
users.groupby('occupation').describe().T

occupation  administrator     artist     doctor   educator   engineer  \
age count       79.000000  28.000000   7.000000  95.000000  67.000000
    mean        38.746835  31.392857  43.571429  42.010526  36.388060
    std         11.123397   8.668116  12.501428  10.413264  11.199236
    min         21.000000  19.000000  28.000000  23.000000  22.000000
    25%         30.000000  25.000000  35.500000  33.000000  28.000000
    50%         37.000000  30.000000  45.000000  42.000000  36.000000
    75%         48.000000  39.000000  48.500000  50.000000  43.000000
    max         70.000000  48.000000  64.000000  63.000000  70.000000

occupation  entertainment  executive  healthcare  homemaker     lawyer  ...  \
age count       18.000000  32.000000   16.000000   7.000000  12.000000  ...
    mean        29.222222  38.718750   41.562500  32.571429  36.750000  ...
    std         10.056052  10.608075   11.313524  10.737119  10.830303  ...
    min         15.000000  22.000000   22.000000  20.000000  21.000000  ...
    25%         23.000000  31.000000   30.500000  24.500000  28.750000  ...
    50%         25.000000  38.500000   44.500000  32.000000  34.000000  ...
    75%         33.000000  46.000000   49.250000  38.500000  47.750000  ...
    max         50.000000  69.000000   62.000000  50.000000  53.000000  ...

occupation  marketing       none       other  programmer    retired  \
age count   26.000000   9.000000  105.000000   66.000000  14.000000
    mean    37.615385  26.555556   34.523810   33.121212  63.071429
    std      9.474500  13.757826   10.738227    9.624512   5.757461
    min     24.000000  11.000000   13.000000   20.000000  51.000000
    25%     30.250000  16.000000   26.000000   27.000000  60.000000
    50%     36.000000  26.000000   32.000000   30.000000  63.000000
    75%     42.500000  33.000000   44.000000   38.000000  67.250000
    max     55.000000  55.000000   64.000000   63.000000  73.000000

occupation   salesman  scientist     student  technician     writer
age count   12.000000  31.000000  196.000000   27.000000  45.000000
    mean    35.666667  35.548387   22.081633   33.148148  36.311111
    std     14.079859   7.392964    5.284081    9.867210  11.423306
    min     18.000000  23.000000    7.000000   21.000000  18.000000
    25%     28.250000  30.000000   19.000000   24.000000  26.000000
    50%     34.000000  37.000000   21.000000   30.000000  36.000000
    75%     38.250000  40.000000   25.000000   40.000000  48.000000
    max     66.000000  55.000000   42.000000   55.000000  60.000000

[8 rows x 21 columns]

In [52]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [89]:
users.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [100]:
aa=users['age'].value_counts().sort_values()
aa[aa==1]

age
73    1
7     1
10    1
11    1
66    1
Name: count, dtype: int64

In [95]:
aa.min()

1